$('#modal').on('click', function(){
    $.alert({
        columnClass: 'col-md-12',
        containerFluid: true, // this will add 'container-fluid' instead of 'container'
        buttons: {
            закрити: {
                btnClass: 'btn-orange',
                action: function(){}
            }},
        title: 'Я згоден на збір та обробку моїх персональних даних',
        content: '<ul>\n' +
            '                    <li>1. Відзначивши пункт на сторінці реєстрації «Я згоден на збір та обробку моїх персональних даних» Користувач — фізична особа — суб’єкт персональних даних надає свою безумовну згоду на збір і обробку персональних даних згідно до нижчезазначених умов:\n' +
            '                        Дана Згода дійсна для використання персональних даних Користувача відповідно до Закону України «Про захист персональних даних» від 01.06.2010р., № 2297-VI .</li>\n' +
            '                    <li>2.  Я, надаю свою згоду на обробку, використання та зберігання моїх персональних даних</li>\n' +
            '                    <li>3. Відзначивши пункт на сторінці реєстрації «Я згоден на збір та обробку моїх персональних даних», я підтверджую, що повідомлений і згодний з наступним:</li>\n' +
            '                    <ul>\n' +
            '                        <li>3.1. Власник здійснює обробку персональних даних Користувача будь-якими способами з метою належного надання Користувачу послуг\n' +
            '                            (ідентифікація, аутентифікація, авторизація, відновлення пароля, відправка інформаційних матеріалів за згодою Користувача, відповідей на\n' +
            '                            запити та листи Користувача, отримання заявок на придбання товару, залишенням відгуків щодо якості обслуговування Власника,\n' +
            '                            для реєстрації в програмі знижок Власника, отримання рекламних та спеціальних пропозицій, інформації про акції, розіграші, іншої інформації про діяльність Власника).</li>\n' +
            '\n' +
            '                        <li>3.2. Під час користування інтернет-сайтом Власник здійснює збір та обробку персональних даних Користувача,\n' +
            '                            пов’язаних з ідентифікацією, аутентифікацією, авторизацією, відновленням пароля, відправкою інформаційних матеріалів за згодою\n' +
            '                            Користувача, відповідями на запити та листи. Серед яких можуть бути наступні персональні дані:</li>\n' +
            '                        <ul>\n' +
            '                            <li>а) прізвище, ім’я, по батькові, місце проживання, телефон, електронна адреса, дата народження;</li>\n' +
            '                            <li>б) Персональні дані, надані Користувачем при заповненні реєстраційних форм:</li>\n' +
            '                        </ul>\n' +
            '                        <li>3.3. Під обробкою персональних даних я розумію збір, реєстрацію, накопичення, зберігання, адаптування, уточнення (оновлення, зміну),\n' +
            '                            використання, поширення, (в тому числі, передачу третім особам) знеособлення, знищення та інші дії (операції) з персональними даними.\n' +
            '                            Зобов’язуюсь при зміні моїх персональних даних надавати у найкоротший термін відповідальній особі уточнену інформацію.</li>\n' +
            '                        <li>3.4. Власник включає дані Користувача з моменту, коли Користувач вперше надає (надсилає) свої персональні дані\n' +
            '                            Власнику шляхом заповнення реєстраційної форми або форми замовлення на інтернет-сторінці Власника.</li>\n' +
            '                        <li>3.5. Власник бази даних не передає персональні дані третім особам без попереднього повідомлення Користувача.\n' +
            '                            Власник бази даних не інформує суб’єкта персональних даних про передачу його персональних даних у випадках, передбачених Законом України «Про захист персональних даних».</li>\n' +
            '\n' +
            '                        <li>3.6. Під час користування Користувачем інтернет-сайтом можуть бути присутніми коди інтернет-ресурсів третіх осіб, у результаті чого такі треті особи отримують дані,\n' +
            '                            позначені в підпунктах в), г) та д) пункту 2 даної Згоди. Такими інтернет-ресурсами третіх осіб є:</li>\n' +
            '                        <ul>\n' +
            '                            <li>— Системи збору статистики відвідувань інтернет-сайту (наприклад, Google Analytics та інші);</li>\n' +
            '                            <li>— Соціальні плагіни (блоки) соціальних мереж (наприклад, Facebook і інші);</li>\n' +
            '                            <li>— системи банеропоказів (наприклад, AdRiver та інші);</li>\n' +
            '                            <li>— інші ресурси;\n' +
            '                        </ul>\n' +
            '                    </ul>\n' +
            '                    <li>4. Користувач має всі права щодо захисту його персональних даних, передбачені чинним законодавством України, зокрема, Законом України «Про захист персональних даних», а саме:</li>\n' +
            '                    <ul>\n' +
            '                        <li> 1) знати про місцезнаходження бази даних, яка містить його персональні дані, її призначення та найменування, місцезнаходження її власника чи розпорядника;</li>\n' +
            '                        <li>2) отримувати інформацію про умови надання доступу до персональних даних, зокрема, інформацію про третіх осіб,\n' +
            '                            яким передаються його персональні дані, що містяться в базі персональних даних;</li>\n' +
            '                        <li>3) на доступ до своїх персональних даних, що містяться у відповідній базі персональних даних;</li>\n' +
            '                        <li>4) отримувати не пізніше, ніж через 30 календарних днів з дня отримання запиту, крім випадків, передбачених законом,\n' +
            '                            інформацію про те, чи зберігаються його персональні дані у відповідній базі персональних даних, а так само одержувати вміст його персональних даних, які зберігаються.</li>\n' +
            '                        <li>5) пред’являти вмотивовану вимогу із запереченням про обробку своїх персональних даних органами державної влади, органами місцевого\n' +
            '                            самоврядування при здійсненні їхніх повноважень, передбачених законом;</li>\n' +
            '                        <li>6) пред’являти вмотивовану вимогу зміни або знищення своїх персональних даних будь-яким власником і\n' +
            '                            розпорядником даної бази, якщо ці дані обробляються незаконно чи не є достовірними;</li>\n' +
            '                        <li>7) на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення,\n' +
            '                            пошкодження у зв’язку з умисним приховуванням, ненаданням чи несвоєчасним наданням,\n' +
            '                            а так само на захист від надання відомостей, які не є достовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;</li>\n' +
            '                        <li>8) звертатися з питань захисту своїх прав щодо персональних даних до органів державної влади, органи місцевого самоврядування, до повноважень яких належить\n' +
            '                            здійснення захисту персональних даних;</li>\n' +
            '                        <li>9) застосовувати засоби правового захисту в разі порушення законодавства про захист персональних даних.</li>\n' +
            '                        <li>10) вносити поправки щодо обмеження права на обробку своїх персональних даних при наданні згоди;</li>\n' +
            '                        <li>11) відкликати згоду на обробку персональних даних;</li>\n' +
            '                        <li>12) знати механізм автоматичної обробки персональних даних;</li>\n' +
            '                        <li>13) на захист від автоматизованого рішення, яке має для нього правові наслідки.</li>\n' +
            '                    </ul>\n' +
            '                    <li>5. Відзначивши пункт на сторінці реєстрації «Я згоден на збір та обробку моїх персональних даних», я також підтверджую,\n' +
            '                        що повідомлений про включення інформації про мене до бази персональних даних з вищезазначеною метою, про мої права, визначених\n' +
            '                        Законом України «Про захист персональних даних », а так само про осіб, яким мої дані передаються для виконання вищевказаної мети.</li>\n' +
            '                </ul>',
    });
});
